---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.SkylightWidth
source: html/ea98f7ae-61f9-e86d-1049-34af57bb37a6.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.SkylightWidth Property

Used for the conceptual energy model. The approximate width used for the skylights in
 massing instances when the Energy Analytical model is being created.

## Syntax (C#)
```csharp
public double SkylightWidth { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The skylight width is less than eight inches.